{"/blog_personal/about/":{"data":{"":"I’m Eletrical Engineer who moved to data science world after a long period of time working with Telecom Projects. My main coding language is python for now, but I’m trying learn also Go, for no reason.\nIf you need a Machine Learning, Data Scients for any project or contract, get in touch via linkedin."},"title":"About"},"/blog_personal/blog/first_post/":{"data":{"the-explanation#The Explanation":"The ExplanationMy main goal right now is getting better at coding and machine learning and besides showing my skills as everyone tells us to do.\nI’m not so good at showing my skills nor keeping easily available any project or semi-finished project that I got involved with. So this blog started for this reason, to keep showing or journaling my skills and doings, as long as I can or get interested.\nI’ll try to cover some specific topics that I didn’t find help for in Portuguese, so I’ll post in English and a translated version in Portuguese."},"title":"Initial Commit"},"/blog_personal/blog/the_blog/":{"data":{"disclaimer#Disclaimer":"DisclaimerGo to main documentation if you need some more explanation, here I’ll show the simple version to create this blog.","host-on-github-pages#Host on GitHub Pages":"","install-hugo#Install Hugo":"For Windows I recomend using Winget, on Powershell:\nwinget install Hugo.Hugo.Extended Configure Go to the folder in which you start your project and run this commands:\n# create a new project with yaml as configuration hugo new site my-blog --format=yaml cd my-blog # set your github hugo mod init github.com/username/my-blog # add Hextra theme hugo mod get github.com/imfing/hextra I choose the Hextra theme and his startup are little different of the used in Hugo configuration as shown in the docs.\nCreate the content pages Create a new content page is very simple, just run the following commands:\nhugo new content/_index.md hugo new content/docs/_index.md Preview hugo server --buildDrafts --disableFastRender "},"title":"How Setup an easy blog with Hugo"}}